[
  
  {
    "from": "December 2022",
    "to": "Present",
    "company": "EPAM Systems",
    "position": "Software Engineer 2",
    "experience": [
      "Collaborated with development teams to uphold React coding standards and quality. Partnered closely with 3+ stakeholders and design teams to align product development with project goals.",
      "Upgraded the <b>MADE version 4.0 to 4.5</b> which is a custom UI library of Mastercard.",
      "Promoted to Software Engineer II in December 2022, after 5 months as Software Engineer I.",
      "Designed and implemented pagination, grid, and filtering components that improved user experience across the application; enhanced load times by 25% and reduced user frustration metrics. Additionally, gained exposure to CI/CD pipelines in Jenkins.",
      "Contributed to Application Management and Maintenance. Collaborated seamlessly with API teams, ensuring requirements alignment. Played a key role in implementing localization/Internationalization feature for the application.",
      "<b>Awarded ”Pat on Back” and ”Delivery Excellence Award”</b> for successfully implementing the localization/Internationalization feature on schedule.",
      "Significantly improved code quality through comprehensive refactoring, addressing multiple loopholes, bugs, and code smells, and achieving a notable increase in unit test coverage from 67% to 95%.",
      "Mentored <b>12 mentees</b> in Front-End development, focusing on web technologies, coding best practices, and project execution.",
      "Tech Stack: ReactJS, Angular, TypeScript, JavaScript, Scss, Sonarcube, Jenkins, Jira, Unit Testing: Karma and Jasmine."
    ],
    "id": 3
  },
  {
    "from": "July 2022",
    "to": "November 2022",
    "company": "EPAM Systems",
    "position": "Software Engineer 1",
    "experience": [
      "Worked on EPAM internal application - EPAM Buddy",
      "Created multifunctional React components designed to seamlessly integrate into diverse projects, offering capabilities like pagination, pop-up dialogs, and accordions, with a focus on encouraging the reuse of code, and resolved UI bugs.",
      "Tech Stack: React, TypeScript, JavaScript"
    ],
    "id": 2
  },
  {
    "from": "January 2022",
    "to": "July 2022",
    "company": "EPAM Systems",
    "position": "Frontend-Intern",
    "experience": [
      "Got trained in technologies like JavaScript, React.js and Node.js",
      "Worked on multiple capstone projects",
      "Used HTML, CSS, and JavaScript to enhance functionality and user experience on web pages."
    ],
    "id": 1
  }
]
