[
  {
    "from": "December 2022",
    "to": "Present",
    "company": "EPAM Systems",
    "position": "Software Engineer",
    "experience": [
      "Working With MasterCard team on building new features for Platform Admin",
      "Developed versatile Angular component for universal project integration, encompassing features such as pagination, popups, and grids, promoting code reusability. Additionally, gained exposure to CI/CD pipelines in Jenkins.",
      "Collaborated with development teams on code reviews to maintain coding standards and quality. Also, worked closely with stakeholders and design teams to align product development with project goals. Contributed to Application Management, and Maintenance. Collaborated seamlessly with API teams, ensuring requirements alignment. Played a key role in implementing localization/Internationalization feature for the application.",
      "Earned ”Pat on Back” title for implementing the localization/Internationalization feature on time for release and significantly improving code quality through refactoring, addressing multiple loopholes, bugs, and code smells, and achieving a remarkable increase in unit test coverage from 67% to 86%",
      "Tech Stack: Angular, TypeScript, JavaScript, Scss, Git-lab, Unit Testing : Karma and Jasmine."
    ],
    "id": 3
  },
  {
    "from": "July 2022",
    "to": "November 2022",
    "company": "EPAM Systems",
    "position": "Junior Software Engineer",
    "experience": [
      "Worked on EPAM internal application - EPAM Buddy",
      "Created multifunctional React components designed to seamlessly integrate into diverse projects, offering capabilities like pagination, pop-up dialogs, and accordions, with a focus on encouraging the reuse of code, and resolved UI bugs.",
      "Tech Stack: React, TypeScript, JavaScript"
    ],
    "id": 2
  },
  {
    "from": "January 2022",
    "to": "July 2022",
    "company": "EPAM Systems",
    "position": "Frontend-Intern",
    "experience": [
      "Got trained in technologies like JavaScript, React.js and Node.js",
      "Worked on multiple capstone projects",
      "Used HTML, CSS, and JavaScript to enhance functionality and user experience on web pages."
    ],
    "id": 1
  }
]
